Repository: mjaber5/Qanoni-App
Catalog: lib/l10n/app_*.arb
Languages: ar

# buyerInfoProperty
source: Buyer Information
ar: معلومات المشتري

# propertyInfoProperty
source: Property Information
ar: معلومات الملكية

# propertyAddressValidation
source: Please enter the property address
ar: يرجى إدخال عنوان الملكية

source: Property Size
ar: حجم الملكية

# propertySizeValidation
source: Please enter the property size
ar: يرجى إدخال حجم الملكية

# propertyPriceValidation
source: Please enter the property price
ar: يرجى إدخال سعر الملكية

# transactionInfoProperty
source: Transaction Information
ar: معلومات المعاملة

# appBarTitleCar
source: Car Sale Contract Input Form
ar: نموذج إدخال عقد بيع السيارة

# propertyInfoCar
source: Car Information
ar: معلومات السيارة

source: Car Brand
ar: ماركة السيارة

# carBrandValidation
source: Please enter the car brand
ar: يرجى إدخال ماركة السيارة

# carModelValidation
source: Please enter the car model
ar: يرجى إدخال طراز السيارة

source: Car Year
ar: سنة السيارة

# carYearValidation
source: Please enter the car year
ar: يرجى إدخال سنة السيارة

# vin
source: Vehicle Identification Number (VIN)
ar: رقم تعريف السيارة (VIN)

# vinValidation
source: Please enter the VIN
ar: يرجى إدخال رقم تعريف السيارة

source: Mechanical Condition
ar: الحالة الميكانيكية

# mechanicalConditionValidation
source: Please enter the mechanical condition
ar: يرجى إدخال الحالة الميكانيكية

source: Selling Price
ar: سعر البيع

# sellingPriceValidation
source: Please enter the selling price
ar: يرجى إدخال سعر البيع

# aboutUsBodyText
source: The Qanoni App aims to digitize and simplify the management of contracts such as rentalagreements, sales contracts, and concessions by transforming user inputs into electronic contracts. These contracts will be based on predefined templates for each contract type.
ar: يهدف تطبيق قانوني إلى رقمنة وتبسيط إدارة العقود مثل عقود الإيجار وعقود البيع والتنازلات من خلال تحويل مدخلات المستخدم إلى عقود إلكترونية، وستعتمد هذه العقود على قوالب محددة مسبقًا لكل نوع من أنواع العقود.

# startNewContract
source: Start a New Contract
ar: ابدأ عقد جديد

source: Draft contracts
ar: العقود المسودة

# enterValidId
source: Please enter a valid ID.
ar: يرجى إدخال معرف صالح.

# selectUserType
source: Please select a user type (Buyer/Seller).
ar: يرجى تحديد نوع المستخدم (مشتري/بائع).

source: Buyer
ar: مشتري

source: or
ar: أو

source: Seller
ar: بائع

# enterId
source: Enter {userType} ID
ar: أدخل معرف {userType}

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Who are you?
ar: من أنت؟

source: Buyer Information Scanner
ar: ماسح معلومات المشتري

source: Front Side
ar: الوجه الأمامي

source: Back Side
ar: الوجه الخلفي

source: Buyer Full Name
ar: اسم المشتري الكامل

source: Buyer Birth Date
ar: تاريخ ميلاد المشتري

source: Buyer National ID
ar: الرقم الوطني للمشتري

source: Buyer Registry Number
ar: رقم تسجيل المشتري

source: Buyer Registry Place
ar: مكان تسجيل المشتري

source: Buyer Expiry Date
ar: تاريخ انتهاء صلاحية المشتري

source: Contract created successfully!
ar: تم إنشاء العقد بنجاح!

# car_info_title
source: Car Information
ar: معلومات السيارة

source: Front Side
ar: الجانب الأمامي

source: Back Side
ar: الجانب الخلفي

source: Car Plate Number
ar: رقم لوحة السيارة

source: VIN Number
ar: رقم الشاسيه

source: Engine Number
ar: رقم المحرك

source: Car Model
ar: طراز السيارة

source: Car Color
ar: لون السيارة

source: Car Registration Number
ar: رقم تسجيل السيارة

source: Insurance Expiry Date
ar: تاريخ انتهاء التأمين

source: Car Condition
ar: حالة السيارة

source: Validation Error
ar: خطأ في التحقق

# fill_all_fields
source: Please fill in all required fields.
ar: يرجى ملء جميع الحقول المطلوبة.

source: OK
ar: موافق

# image_picker_camera
source: Pick Image
ar: التقط صورة

# contractInfoForm
source: Contract Information
ar: معلومات العقد

source: Contract Date
ar: تاريخ العقد

source: Capture Signature
ar: ألتقط التوقيع

source: Sale Amount
ar: قيمة البيع

source: Legal ownership transfer commitment
ar: الالتزام بنقل الملكية القانونية

source: Additional Terms
ar: شروط إضافية

source: Save Data
ar: حفظ البيانات

source: Please fill in all required fields.
ar: يرجى ملء جميع الحقول المطلوبة.

source: Contract data submitted successfully!
ar: تم إرسال بيانات العقد بنجاح!

source: Error saving contract data
ar: حدث خطأ أثناء حفظ بيانات العقد

source: Cash
ar: نقداً

source: Bank Transfer
ar: تحويل بنكي

source: Credit Card
ar: بطاقة ائتمان

source: Online Payment
ar: دفع عبر الإنترنت

source: Seller Information Scanner
ar: ماسح بيانات البائع

source: Seller Full Name
ar: اسم البائع بالكامل

source: Seller Birth Date
ar: تاريخ ميلاد البائع

source: Seller National ID
ar: الرقم الوطني للبائع

source: Seller Registry Number
ar: رقم السجل للبائع

source: Seller Registry Place
ar: مكان السجل للبائع

source: Seller Expiry Date
ar: تاريخ انتهاء صلاحية البائع

source: Validation Error
ar: خطأ في التحقق

# pleaseFillInAllFields
source: Please fill in all required fields.
ar: الرجاء تعبئة جميع الحقول المطلوبة.

source: Failed to pick image
ar: فشل في اختيار الصورة

source: Failed to process image
ar: فشل في معالجة الصورة

# errorSavingSellerData
source: Error saving seller data: {error}
ar: خطأ في حفظ بيانات البائع: {error}

source: Seller data submitted successfully!
ar: تم إرسال بيانات البائع بنجاح!

source: All
ar: الكل

source: Request
ar: طلب

source: Progress status
ar: حالة التقدم

# no_pending_contracts
source: No pending contracts found.
ar: لا توجد عقود معلقة.

# contract_request_title
source: ðŸ“œ Contract Request
ar: 📜 طلب عقد

# contract_request_body
source: Please review and approve or reject the contract.
ar: يرجى مراجعة العقد والموافقة عليه أو رفضه.

source: Done Notification
ar: تم إشعار

source: All Notification
ar: جميع الإشعارات

# notification_description
source: This is a detailed description of the notification that can span two lines.
ar: هذه هي الوصف التفصيلي للإشعار الذي يمكن أن يمتد إلى سطرين.
