Repository: mjaber5/Qanoni-App
Catalog: lib/l10n/app_*.arb
Languages: ar

# equipment_terms
source: Equipment Purchase Contract Terms: 1. The property must be in good condition. 2. The buyer must be financially qualified. 3. The transfer of ownership must comply with local laws. 4. All documents must be verified before signing. 5. Any liens or debts must be settled before transfer. 6. The buyer has the right to inspect the property. 7. The seller guarantees clear ownership rights to the property.
ar: شروط عقد شراء المعدات: 1. يجب أن تكون الملكية في حالة جيدة. 2. يجب أن يكون المشتري مؤهلاً مالياً. 3. يجب أن يتوافق نقل الملكية مع القوانين المحلية. 4. يجب التحقق من جميع الوثائق قبل التوقيع. 5. يجب تسوية أي رهون أو ديون قبل النقل. 6. يحق للمشتري فحص الملكية. 7. يضمن البائع حقوق ملكية واضحة للملكية.

# business_partnership_waiver_terms
source: Terms for Business Partnership Waiver: 1. Both parties must fully disclose all financial statements and liabilities. 2. The seller guarantees no pending legal disputes that may affect the partnership's value. 3. The buyer has the right to inspect partnership records before agreement. 4. All relevant taxes must be settled before the waiver. 5. Both parties agree to comply with all local business transfer regulations. 6. Both parties agree to maintain confidentiality regarding the waiver details. 7. The buyer understands the responsibility of any future financial obligations of the partnership. 8. Any misrepresentation by either party may lead to legal action and potential voiding of the contract.
ar: شروط تنازل عن الشراكة التجارية: 1. يجب على الطرفين الإفصاح الكامل عن جميع البيانات المالية والالتزامات. 2. يضمن البائع عدم وجود نزاعات قانونية معلقة قد تؤثر على قيمة الشراكة. 3. يحق للمشتري فحص سجلات الشراكة قبل الاتفاق. 4. يجب تسوية جميع الضرائب ذات الصلة قبل التنازل. 5. يتعهد الطرفان بالامتثال لجميع لوائح نقل الأعمال المحلية. 6. يتفق الطرفان على الحفاظ على سرية تفاصيل التنازل. 7. يفهم المشتري مسؤولية أي التزامات مالية مستقبلية للشراكة. 8. أي تحريف من أي طرف قد يؤدي إلى اتخاذ إجراءات قانونية وقد يؤدي إلى إبطال العقد.

# carWaiverTerms
source: 1. Both parties must fully disclose all financial statements and liabilities. 2. The seller guarantees no pending legal disputes that may affect the partnership's value. 3. The buyer has the right to inspect partnership records before agreement. 4. All relevant taxes must be settled before the waiver. 5. Both parties agree to comply with all local business transfer regulations. 6. Both parties agree to maintain confidentiality regarding the waiver details. 7. The buyer understands the responsibility of any future financial obligations of the partnership. 8. Any misrepresentation by either party may lead to legal action and potential voiding of the contract.
ar: 1. يجب على كلا الطرفين الإفصاح عن جميع البيانات المالية والالتزامات. 2. يضمن البائع عدم وجود نزاعات قانونية معلقة قد تؤثر على قيمة الشراكة. 3. للمشتري الحق في فحص سجلات الشراكة قبل الاتفاق. 4. يجب تسوية جميع الضرائب ذات الصلة قبل التنازل. 5. يتفق الطرفان على الامتثال لجميع اللوائح المحلية لنقل الأعمال. 6. يتفق الطرفان على الحفاظ على سرية تفاصيل التنازل. 7. يدرك المشتري مسؤولية أي التزامات مالية مستقبلية للشراكة. 8. قد يؤدي أي تلاعب من أي من الطرفين إلى اتخاذ إجراءات قانونية وإبطال العقد المحتمل.

# agreeToTerms
source: I have read and agree with the above terms and conditions
ar: لقد قرأت ووافقت على الشروط والأحكام المذكورة أعلاه

source: Start
ar: بدء

source: National ID
ar: الرقم الوطني

# intellectual_waiver_terms_text
source: Confidentiality obligations 1- Data security compliance 1 - Ownership acknowledgment 1 - Non-disclosure agreements 1- Limits on liability for damages
ar: التزامات السرية 1- الامتثال لأمن البيانات 1- الإقرار بالملكية 1- اتفاقيات عدم الإفشاء 1- حدود المسؤولية عن الأضرار

source: Edit Post
ar: تعديل المنشور

# editPostDescription
source: Action to modify an existing post or content.
ar: إجراء لتعديل منشور أو محتوى موجود.

source: Save Post
ar: حفظ المنشور

# savePostDescription
source: Action to preserve changes made to a post or content.
ar: إجراء لحفظ التغييرات التي تم إجراؤها على منشور أو محتوى.

source: Comments
ar: التعليقات

# commentsDescription
source: Reactions or opinions shared by users on posts.
ar: ردود أو آراء يشاركها المستخدمون على المنشورات.

source: Type Comment...
ar: اكتب تعليق...

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

# termsOfUs
source: Terms of Use
ar: شروط الاستخدام

source: Remember Me
ar: ذكرني

# signupAboutAppp
source: Sign up now and start exploring all that our app has to offer.
ar: سجل الآن وابدأ باستكشاف كل ما يقدمه تطبيقنا.

# descAppContenar
source: An innovative platform for creating and managing electronic contracts with ease.
ar: منصة مبتكرة لإنشاء وإدارة العقود الإلكترونية بسهولة ويسر.

source: Account information
ar: معلومات الحساب

source: birthday
ar: تاريخ ميلادك

# profileEmailHintText
source: Enter your Email
ar: أدخل البريد الالكتروني

# settingsLanguage
source: Language
ar: اللغة

# changeLanguageEnglishOption
source: English
ar: الانجليزيه

# changeLanguageArabicOption
source: Arabic
ar: العربيه

# profileBirthdayHintText
source: Enter your birthday
ar: أدخل تاريخ ميلادك

# historyAppBarTitle
source: History
ar: التاريخ

source: Update your credentials
ar: تحديث بيانات الاعتماد الخاصة بك،

# secureChange
source: Secure your account by changing your password regularly.
ar: قم بتأمين حسابك عن طريق تغيير كلمة المرور الخاصة بك بانتظام.

# byChanePassword
source: By changing your password, you agree to our:
ar: من خلال تغيير كلمة المرور الخاصة بك، فإنك توافق على:

# profilePhoneHintText
source: Enter your phone
ar: أدخل رقم هاتقك

# dark
source: Dark mode
ar: الوضع المظلم

source: Logout
ar: تسجيل الخروج

# byLogin
source: By logging in, you agree to our:
ar: من خلال تسجيل الدخول، فإنك توافق على:

# restEmail
source: Enter your email to reset your password.
ar: أدخل بريدك الإلكتروني لإعادة تعيين كلمة المرور الخاصة بك.

# byRequest
source: By requesting a password reset, you agree to our:
ar: من خلال طلب إعادة تعيين كلمة المرور، فإنك توافق على:

source: Change Password
ar: تغيير كلمة المرور

source: Forgot Password?
ar: نسيت كلمة المرور؟

# resetPasswordInstructions
source: Enter your email or phone number to search for your account.
ar: أدخل بريدك الإلكتروني أو رقم هاتفك للبحث عن حسابك.

# enterEmailOrPhone
source: Enter your email or phone number
ar: أدخل بريدك الإلكتروني أو رقم هاتفك

# enterValidContact
source: Please enter a valid email or phone number
ar: يرجى إدخال بريد إلكتروني أو رقم هاتف صحيح

source: Send Request
ar: إرسال الطلب

# requestSent
source: Request sent successfully
ar: تم إرسال الطلب بنجاح

# errorOccurred
source: An error occurred, please try again
ar: حدث خطأ، يرجى المحاولة مرة أخرى

source: Send Reset Email
ar: إرسال بريد إلكتروني لإعادة تعيين كلمة المرور

# typeCommentDescription
source: Field where users enter reactions or opinions on posts.
ar: الحقل الذي يدخل فيه المستخدمون ردود الفعل أو الآراء حول المنشورات.

source: About
ar: حول

# sellCardCar
source: Car Sales Contract
ar: عقد بيع سيارة

# sellPropertyCard
source: Property Sales Contract
ar: عقد بيع عقار

# sellLandCard
source: Land Sales Contract
ar: عقد بيع أرض

# sellEquipmentCard
source: Equipment Sales Contract
ar: عقد بيع معدات

# sellTerminationCard
source: Sales Cancellation Contract
ar: عقد إلغاء بيع

source: Car Rental Contract
ar: عقد إيجار سيارة

source: House Rental Contract
ar: عقد إيجار بيت

source: Equipment Rental Contract
ar: عقد إيجار معدات

source: Daily Rental Contract
ar: عقد إيجار مياومة

source: Cancellation Form
ar: استمارة إلغاء عقد الإيجار

source: Contracts
ar: العقود

source: Contract Agreement
ar: اتفاقية مقاولة

source: Public Services Contract
ar: عقد خدمات عامة

source: Work Import Contract
ar: استقدام عمل

source: Ministry Work Model
ar: نموذج عمل وزاري

source: Daily Work Contract
ar: عقد عمل مياومة

# intellectualRightsWaiverLabel
source: Intellectual Rights Waiver
ar: تنازل عن حقوق فكرية

# businessPartnershipWaiverLabel
source: Business Partnership Waiver
ar: تنازل عن شراكة تجارية

# legalFinancialRightsWaiverLabel
source: Legal/Financial Rights Waiver
ar: تنازل عن حقوق قانونية / مالية

# propertyWaiverLabel
source: Property Waiver
ar: تنازل عن ملكية

# vehicleWaiverLabel
source: Vehicle Waiver
ar: تنازل عن مركبة

# contractInputTitle
source: Contract Input
ar: إدخال العقد

# projectNameLabel
source: Project Name
ar: اسم المشروع

# projectNameValidation
source: Please enter the project name
ar: يرجى إدخال اسم المشروع

# projectOwnerNameLabel
source: Project Owner's Name
ar: اسم صاحب المشروع

# projectOwnerNameValidation
source: Please enter the project owner's name
ar: يرجى إدخال اسم صاحب المشروع

# projectOwnerIdLabel
source: Project Owner's ID
ar: رقم هوية صاحب المشروع

# projectOwnerIdValidation
source: Please enter the project owner's ID
ar: يرجى إدخال رقم هوية صاحب المشروع

# contractorNameLabel
source: Contractor's Name
ar: اسم المقاول

# contractorNameValidation
source: Please enter the contractor's name
ar: يرجى إدخال اسم المقاول

# contractorIdLabel
source: Contractor's ID
ar: رقم هوية المقاول

# contractorIdValidation
source: Please enter the contractor's ID
ar: يرجى إدخال رقم هوية المقاول

# contractDurationLabel
source: Contract Duration
ar: مدة العقد

# contractDurationValidation
source: Please enter the contract duration
ar: يرجى إدخال مدة العقد

# contractValueLabel
source: Total Contract Value
ar: قيمة العقد الإجمالية

# contractValueValidation
source: Please enter the contract value
ar: يرجى إدخال قيمة العقد

# materialsProvidedLabel
source: Materials and Equipment
ar: المواد والمعدات

# materialsProvidedValidation
source: Please enter the required materials and equipment
ar: يرجى إدخال المواد والمعدات اللازمة

# startDateLabel
source: Contract Start Date
ar: تاريخ بدء العقد

# startDateValidation
source: Please enter the contract start date
ar: يرجى إدخال تاريخ بدء العقد

# saveButton
source: Save
ar: حفظ

# successMessage
source: Data entered successfully
ar: تم الحفظ بنجاح

# errorMessage
source: Invalid data. Please check.
ar: حدث خطأ أثناء الحفظ

# firstPartyNameLabel
source: First Party Name
ar: اسم الطرف الأول

# firstPartyNameValidation
source: Please enter the first party's name
ar: يرجى إدخال اسم الطرف الأول

# firstPartyIdLabel
source: First Party ID
ar: رقم هوية الطرف الأول

# firstPartyIdValidation
source: Please enter the first party's ID
ar: يرجى إدخال رقم تعريف الطرف الأول

# firstPartyAddressLabel
source: First Party Address
ar: عنوان الطرف الأول

# firstPartyAddressValidation
source: Please enter the first party's address
ar: يرجى إدخال عنوان الطرف الأول

# firstPartyPhoneLabel
source: First Party Phone
ar: هاتف الطرف الأول

# firstPartyPhoneValidation
source: Please enter the first party's phone number
ar: يرجى إدخال رقم هاتف الطرف الأول

# secondPartyNameLabel
source: Second Party Name
ar: اسم الطرف الثاني

# secondPartyNameValidation
source: Please enter the second party's name
ar: يرجى إدخال اسم الطرف الثاني

# secondPartyIdLabel
source: Second Party ID
ar: رقم تعريف الطرف الثاني

# secondPartyIdValidation
source: Please enter the second party's ID
ar: يرجى إدخال رقم تعريف الطرف الثاني

# secondPartyNationalityLabel
source: Second Party Nationality
ar: جنسية الطرف الثاني

# secondPartyNationalityValidation
source: Please enter the second party's nationality
ar: يرجى إدخال جنسية الطرف الثاني

# secondPartyAddressLabel
source: Second Party Address
ar: عنوان الطرف الثاني

# secondPartyAddressValidation
source: Please enter the second party's address
ar: يرجى إدخال عنوان الطرف الثاني

# secondPartyPhoneLabel
source: Second Party Phone
ar: هاتف الطرف الثاني

# secondPartyPhoneValidation
source: Please enter the second party's phone number
ar: يرجى إدخال رقم هاتف الطرف الثاني

# jobTitleLabel
source: Job Title
ar: الوظيفة

# jobTitleValidation
source: Please enter the job title
ar: يرجى إدخال المسمى الوظيفي

# contractStartDateLabel
source: Contract Start Date
ar: تاريخ بدء العقد

# contractStartDateValidation
source: Please enter the contract start date
ar: يرجى إدخال تاريخ بدء العقد

# dailyWageLabel
source: Daily Wage
ar: الأجر اليومي

# dailyWageValidation
source: Please enter the daily wage
ar: يرجى إدخال الأجر اليومي

# workingHoursLabel
source: Working Hours
ar: عدد ساعات العمل

# workingHoursValidation
source: Please enter the working hours
ar: يرجى إدخال عدد ساعات العمل

# breakDurationLabel
source: Break Duration
ar: مدة الاستراحة

# breakDurationValidation
source: Please enter the break duration
ar: يرجى إدخال مدة الاستراحة

# title
source: Labor Contract Input - Ministry of Labor
ar: إدخال بيانات عقد عمل - وزارة العمل

# first_party
source: First Party (Company) Name
ar: اسم الطرف الأول (الشركة)

# legal_rep
source: Legal Representative
ar: الممثل القانوني

source: Commercial Register
ar: السجل التجاري

source: First Party Address
ar: عنوان الطرف الأول

source: First Party Phone
ar: هاتف الطرف الأول

# second_party
source: Second Party (Employee) Name
ar: اسم الطرف الثاني (الموظف)

source: Nationality
ar: جنسية الطرف الثاني

# id
source: ID / Residence Number
ar: رقم الهوية/الإقامة

source: Second Party Address
ar: عنوان الطرف الثاني

source: Second Party Phone
ar: هاتف الطرف الثاني

source: Job Title
ar: الوظيفة

source: Contract Duration
ar: مدة العقد

# salary
source: Monthly Salary
ar: الأجر الشهري

source: Start Date
ar: تاريخ بدء العقد

source: Submit
ar: إرسال

# success_message
source: Data has been successfully entered.
ar: تم إدخال البيانات بنجاح.

# error_message
source: Data is incorrect. Please check.
ar: البيانات غير صحيحة. يرجى التحقق.

# enter_first_party_name
source: Please enter the first party name
ar: يرجى إدخال اسم الطرف الأول

# enter_legal_rep
source: Please enter the legal representative
ar: يرجى إدخال الممثل القانوني

# enter_commercial_register
source: Please enter the commercial register
ar: يرجى إدخال السجل التجاري

# enter_first_party_address
source: Please enter the first party address
ar: يرجى إدخال عنوان الطرف الأول

# enter_first_party_phone
source: Please enter the first party phone
ar: يرجى إدخال رقم هاتف الطرف الأول

# enter_second_party_name
source: Please enter the second party name
ar: يرجى إدخال اسم الطرف الثاني

# enter_nationality
source: Please enter the nationality
ar: يرجى إدخال الجنسية

# enter_id
source: Please enter the ID number
ar: يرجى إدخال رقم الهوية

# enter_second_party_address
source: Please enter the second party address
ar: يرجى إدخال عنوان الطرف الثاني

# enter_second_party_phone
source: Please enter the second party phone
ar: يرجى إدخال رقم هاتف الطرف الثاني

# enter_job_title
source: Please enter the job title
ar: يرجى إدخال المسمى الوظيفي

# enter_contract_duration
source: Please enter the contract duration
ar: يرجى إدخال مدة العقد

# enter_salary
source: Please enter the salary
ar: يرجى إدخال الراتب

# enter_start_date
source: Please enter the start date
ar: يرجى إدخال تاريخ بدء العقد

# input_contract_data
source: Input Public Service Contract Data
ar: إدخال بيانات عقد خدمات عامة

source: First Party Name
ar: اسم الطرف الأول

source: Second Party Name
ar: اسم الطرف الثاني

source: Service Description
ar: وصف الخدمة

source: Service Fee
ar: المقابل المالي

# enter_service_description
source: Please enter the service description
ar: يرجى إدخال وصف الخدمة

# enter_service_fee
source: Please enter the service fee
ar: يرجى إدخال المقابل المالي

source: Save
ar: حفظ

# contractInputFormTitle
source: Work Import Contract Input Form
ar: إدخال بيانات عقد عمل للاستقدام

# firstPartyLabel
source: First Party Name
ar: اسم الطرف الأول

# firstPartyNationalityLabel
source: First Party Nationality
ar: جنسية الطرف الأول

# secondPartyLabel
source: Second Party Name
ar: اسم الطرف الثاني

# secondPartyPassportLabel
source: Second Party Passport
ar: رقم جواز سفر الطرف الثاني

# salaryLabel
source: Salary
ar: الأجر

# submitButton
source: Save
ar: حفظ

# dataEnteredSuccess
source: Data entered successfully.
ar: تم إدخال البيانات بنجاح.

# dataInvalid
source: Invalid data. Please check.
ar: البيانات غير صحيحة. يرجى التحقق.

# firstPartyValidator
source: Please enter the first party name.
ar: يرجى إدخال اسم الطرف الأول.

# firstPartyIdValidator
source: Please enter the first party ID.
ar: يرجى إدخال رقم هوية الطرف الأول.

# firstPartyNationalityValidator
source: Please enter the first party nationality.
ar: يرجى إدخال جنسية الطرف الأول.

# secondPartyValidator
source: Please enter the second party name.
ar: يرجى إدخال اسم الطرف الثاني.

# secondPartyPassportValidator
source: Please enter the second party passport number.
ar: يرجى إدخال رقم جواز سفر الطرف الثاني.

# secondPartyNationalityValidator
source: Please enter the second party nationality.
ar: يرجى إدخال جنسية الطرف الثاني.

# jobTitleValidator
source: Please enter the job title.
ar: يرجى إدخال الوظيفة.

# contractDurationValidator
source: Please enter the contract duration
ar: يجب إدخال مدة العقد

# salaryValidator
source: Please enter the salary.
ar: يرجى

source: Landlord Name
ar: اسم المؤجر

# landlordNameValidator
source: Please enter the landlord's name
ar: يجب إدخال اسم المؤجر

source: Landlord ID
ar: رقم هوية المؤجر

# landlordIdValidator
source: Please enter the landlord's ID
ar: يجب إدخال رقم هوية المؤجر

source: Tenant Name
ar: اسم المستأجر

# tenantNameValidator
source: Please enter the tenant's name
ar: يجب إدخال اسم المستأجر

source: Tenant ID
ar: رقم هوية المستأجر

# tenantIdValidator
source: Please enter the tenant's ID
ar: يجب إدخال رقم هوية المستأجر

source: Car Type
ar: نوع السيارة

# carTypeValidator
source: Please enter the car type
ar: يرجى إدخال نوع السيارة

source: Car Model
ar: طراز السيارة

# carModelValidator
source: Please enter the car model
ar: يرجى إدخال طراز السيارة

source: Car Color
ar: لون السيارة

# carColorValidator
source: Please enter the car color
ar: يرجى إدخال لون السيارة

source: Engine Capacity
ar: سعة المحرك

# engineCapacityValidator
source: Please enter the engine capacity
ar: يرجى إدخال سعة المحرك

source: Rent Amount
ar: قيمة الإيجار

# rentAmountValidator
source: Please enter the rent amount
ar: يجب إدخال قيمة الإيجار

source: Contract Start Date
ar: تاريخ بدء العقد

# contractStartDateValidator
source: Please enter the contract start date
ar: يجب إدخال تاريخ بدء العقد

source: Contract Duration
ar: مدة العقد

source: Landlord Address
ar: عنوان المالك

# landlordAddressValidator
source: Please enter the landlord's address
ar: يرجى إدخال عنوان المالك

source: Tenant Address
ar: عنوان المستأجر

# tenantAddressValidator
source: Please enter the tenant's address
ar: يرجى إدخال عنوان المستأجر

source: Property Location
ar: موقع العقار

# propertyLocationValidator
source: Please enter the property location
ar: يرجى إدخال موقع العقار

source: Daily Rent Value
ar: قيمة الإيجار اليومي

# dailyRentValueValidator
source: Please enter the daily rent value
ar: يرجى إدخال قيمة الإيجار اليومي

source: Contract End Date
ar: تاريخ انتهاء العقد

# contractEndDateValidator
source: Please enter the contract end date
ar: يرجى إدخال تاريخ انتهاء العقد

source: Equipment Name
ar: اسم المعدات

# equipmentNameValidator
source: Please enter the equipment name
ar: يرجى إدخال اسم المعدات

source: Equipment Brand
ar: ماركة المعدات

# equipmentBrandValidator
source: Please enter the equipment brand
ar: يرجى إدخال ماركة المعدات

source: Manufacture Date
ar: تاريخ التصنيع

# manufactureDateValidator
source: Please enter the manufacture date
ar: يرجى إدخال تاريخ التصنيع

source: Equipment Quantity
ar: كمية المعدات

# equipmentQuantityValidator
source: Please enter the equipment quantity
ar: يرجى إدخال كمية المعدات

source: Rent Value
ar: قيمة الإيجار

# rentValueValidator
source: Please enter the rent value
ar: يرجى إدخال قيمة الإيجار

source: Property Address
ar: عنوان الملكية

# propertyAddressValidator
source: Please enter the property address
ar: يجب إدخال عنوان العقار

source: City
ar: المدينة

# cityValidator
source: Please enter the city name
ar: يجب إدخال اسم المدينة

source: Contract Number
ar: رقم العقد

# contractNumberValidator
source: Please enter the contract number
ar: يجب إدخال رقم العقد

# formSubmittedSuccess
source: Form submitted successfully
ar: تم إرسال النموذج بنجاح

# cancellationReason
source: Reason for Cancellation
ar: سبب الإلغاء

# cancellationReasonValidator
source: Please enter a reason for cancellation
ar: يرجى إدخال سبب الإلغاء

# leaseCancellationTitle
source: Lease Cancellation Form
ar: نموذج إلغاء الإيجار

# appBarTitleEquipment
source: Equipment Sale Contract
ar: عقد بيع المعدات

# partiesInfo
source: Parties Information
ar: معلومات الأطراف

source: Vendor Name
ar: اسم البائع

# vendorNameValidation
source: Please enter the vendor name.
ar: يرجى إدخال اسم البائع.

source: Vendor Address
ar: عنوان البائع

# vendorAddressValidation
source: Please enter the vendor address.
ar: يرجى إدخال عنوان البائع.

source: Purchaser Name
ar: اسم المشتري

# purchaserNameValidation
source: Please enter the purchaser name.
ar: يرجى إدخال اسم المشتري.

source: Purchaser Address
ar: عنوان المشتري

# purchaserAddressValidation
source: Please enter the purchaser address.
ar: يرجى إدخال عنوان المشتري.

source: Equipment Details
ar: تفاصيل المعدات

source: Equipment Type
ar: نوع المعدات

# equipmentTypeValidation
source: Please enter the equipment type.
ar: يرجى إدخال نوع المعدات.

source: Equipment Model
ar: طراز المعدات

# equipmentModelValidation
source: Please enter the equipment model.
ar: يرجى إدخال طراز المعدات.

source: Equipment Serial Number
ar: رقم السيريال للمعدات

# equipmentSerialNumberValidation
source: Please enter the equipment serial number.
ar: يرجى إدخال رقم السيريال للمعدات.

source: Equipment Condition
ar: حالة المعدات

# equipmentConditionValidation
source: Please enter the equipment condition.
ar: يرجى إدخال حالة المعدات.

source: Sale Details
ar: تفاصيل البيع

source: Price
ar: السعر

# priceValidation
source: Please enter the price.
ar: يرجى إدخال السعر.

source: Sale Date
ar: تاريخ البيع

# saleDateValidation
source: Please enter the sale date
ar: يرجى إدخال تاريخ البيع

source: Date entered successfully
ar: تم إدخال التاريخ بنجاح

# landSaleContractInfoAppBar
source: Land Sale Contract Information
ar: معلومات عقد بيع الأرض

# dateLabel
source: Date
ar: التاريخ

# validatoreMessageEnterDate
source: Please enter the date
ar: يرجى إدخال التاريخ

# paritesInformation
source: Parties Information
ar: معلومات الأطراف

# sellerNameValidatoreMessage
source: Please enter the seller's name
ar: يرجى إدخال اسم البائع

# sellerAddressValidatoreMessage
source: Please enter the seller's address
ar: يرجى إدخال عنوان البائع

# buyerNameValidatorMessage
source: Please enter the buyer's name
ar: يرجى إدخال اسم المشتري

# buyerAddressValidatorMessage
source: Please enter the buyer's address
ar: يرجى إدخال عنوان المشتري

source: Property Details
ar: تفاصيل العقار

source: Property Type
ar: نوع العقار

# propertyTypeValidatorMessage
source: Please enter the property type
ar: يرجى إدخال نوع العقار

source: Property Number
ar: رقم العقار

# propertyNumberValidatorMessage
source: Please enter the property number
ar: يرجى إدخال رقم العقار

source: Parcel Number
ar: رقم القطعة

# parcelNumberValidatorMessage
source: Please enter the parcel number
ar: يرجى إدخال رقم القطعة

source: Land Area
ar: مساحة الأرض

# landAreaValidatorMessage
source: Please enter the land area
ar: يرجى إدخال مساحة الأرض

source: Apartment Number
ar: رقم الشقة

# apartmentNumberValidatorMessage
source: Please enter the apartment number
ar: يرجى إدخال رقم الشقة

source: Property Price
ar: سعر الملكية

# amountLabel
source: Amount
ar: المبلغ

# amountLabelValidatorMessage
source: Please enter the amount
ar: يرجى إدخال المبلغ

# dateEnteredSuccessfuly
source: Date entered successfully
ar: تم إدخال التاريخ بنجاح

# appBarTitleProperty
source: Property Contract
ar: عقد الملكية

# sellerInfoProperty
source: Seller Information
ar: معلومات البائع
