Repository: mjaber5/Qanoni-App
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Qanoni
ar: قانوني

source: Welcome Back
ar: مرحبًا بعودتك

# makeYourServicesApp
source: Make your services online with Qanoni app.
ar: اجعل خدماتك متاحة عبر الإنترنت مع تطبيق قانوني.

source: Hello World!
ar: مرحبًا بالعالم!

# loginForgotPassword
source: Forgot Password?
ar: نسيت كلمة المرور؟

# loginTextQuestion
source: Don't have an account?
ar: لا تملك حسابًا؟

# loginSignupTextNavigator
source: Signup
ar: تسجيل

# loginConditionText
source: By logging in, you agree to our
ar: عند تسجيل الدخول، فإنك توافق على

# loginTermsAndConditions
source: Terms & Conditions
ar: الشروط والأحكام

# loginAndText
source: and
ar: و

# appBarTitleWaiverBusinessPartnership
source: Waiver of Business Partnership
ar: تنازل عن شراكة تجارية

# sellerInfo
source: Seller Information
ar: معلومات البائع

source: Seller Name
ar: اسم البائع

# sellerNameValidation
source: Please enter the seller's name
ar: يرجى إدخال اسم البائع

source: Seller ID
ar: رقم هوية البائع

# sellerIdValidation
source: Please enter the seller's ID
ar: يرجى إدخال رقم هوية البائع

source: Seller Address
ar: عنوان البائع

# sellerAddressValidation
source: Please enter the seller's address
ar: يرجى إدخال عنوان البائع

# buyerInfo
source: Buyer Information
ar: معلومات المشتري

source: Buyer Name
ar: اسم المشتري

# buyerNameValidation
source: Please enter the buyer's name
ar: يرجى إدخال اسم المشتري

source: Buyer ID
ar: رقم هوية المشتري

# buyerIdValidation
source: Please enter the buyer's ID
ar: يرجى إدخال رقم هوية المشتري

source: Buyer Address
ar: عنوان المشتري

# buyerAddressValidation
source: Please enter the buyer's address
ar: يرجى إدخال عنوان المشتري

source: Business Details
ar: تفاصيل العمل

source: Business Type
ar: نوع العمل

# businessTypeValidation
source: Please enter the business type
ar: يرجى إدخال نوع العمل

# businessDetailsLabel
source: Business Details
ar: تفاصيل العمل

# businessDetailsValidation
source: Please provide the business details
ar: يرجى إدخال تفاصيل العمل

# waiverReason
source: Reason for Waiver
ar: سبب التنازل

# waiverReasonValidation
source: Please enter the reason for waiver
ar: يرجى إدخال سبب التنازل

source: Transaction Details
ar: تفاصيل الصفقة

source: Waiver Price
ar: سعر التنازل

# waiverPriceValidation
source: Please enter the waiver price
ar: يرجى إدخال سعر التنازل

source: Payment Method
ar: طريقة الدفع

# paymentMethodValidation
source: Please enter the payment method
ar: يرجى إدخال طريقة الدفع

source: Waiver Date
ar: تاريخ التنازل

# waiverDateValidation
source: Please select the waiver date
ar: يرجى إدخال تاريخ التنازل

source: Data entered successfully
ar: تم إدخال البيانات بنجاح

# appBarTitleWaiverCar
source: Car Ownership Transfer
ar: نقل ملكية السيارة

# waiverInfo
source: Waiver Information
ar: معلومات التنازل

source: Asset Type
ar: نوع الأصل

# assetTypeValidation
source: Please enter the asset type
ar: يرجى إدخال نوع الأصل

source: Asset Details
ar: تفاصيل الأصل

# assetDetailsValidation
source: Please enter asset details
ar: يرجى إدخال تفاصيل الأصل

source: Ownership Status
ar: حالة الملكية

# ownershipStatusValidation
source: Please enter the ownership status
ar: يرجى إدخال حالة الملكية

# transactionInfo
source: Transaction Information
ar: معلومات المعاملة

# appBarTitleWaiverLegalFinancial
source: Legal and Financial Rights Waiver
ar: التنازل عن الحقوق القانونية والمالية

# rightsHolderInfo
source: Rights Holder Information
ar: معلومات حامل الحقوق

# rightsHolderName
source: Rights Holder's Name
ar: اسم حامل الحقوق

# rightsHolderNameValidation
source: Please enter the rights holder's name
ar: يرجى إدخال اسم حامل الحقوق

# rightsHolderId
source: Rights Holder's ID Number
ar: رقم هوية حامل الحقوق

# rightsHolderIdValidation
source: Please enter the rights holder's ID number
ar: يرجى إدخال رقم هوية حامل الحقوق

# rightsHolderAddress
source: Rights Holder's Address
ar: عنوان حامل الحقوق

# rightsHolderAddressValidation
source: Please enter the rights holder's address
ar: يرجى إدخال عنوان حامل الحقوق

# transfereeInfo
source: Transferee Information
ar: معلومات المتنازل إليه

# transfereeName
source: Transferee's Name
ar: اسم المتنازل إليه

# transfereeNameValidation
source: Please enter the transferee's name
ar: يرجى إدخال اسم المتنازل إليه

# transfereeId
source: Transferee's ID Number
ar: رقم هوية المتنازل إليه

# transfereeIdValidation
source: Please enter the transferee's ID number
ar: يرجى إدخال رقم هوية المتنازل إليه

# transfereeAddress
source: Transferee's Address
ar: عنوان المتنازل إليه

# transfereeAddressValidation
source: Please enter the transferee's address
ar: يرجى إدخال عنوان المتنازل إليه

# rightsInfo
source: Rights Information
ar: معلومات الحقوق

# rightsType
source: Type of Rights
ar: نوع الحقوق

# rightsTypeValidation
source: Please enter the type of rights
ar: يرجى إدخال نوع الحقوق

# rightsDetails
source: Details of Rights
ar: تفاصيل الحقوق

# rightsDetailsValidation
source: Please enter details of rights
ar: يرجى إدخال تفاصيل الحقوق

# appBarTitleWaiverIntellectual
source: Intellectual Property Waiver
ar: التنازل عن الملكية الفكرية

# appBarTitleWaiverProperty
source: Property Waiver
ar: تنازل عن الملكية

# propertyInfo
source: Property Information
ar: معلومات الملكية

# propertyTypeValidation
source: Please enter the property type
ar: يرجى إدخال نوع الملكية

# propertyDetailsValidation
source: Please enter property details
ar: يرجى إدخال تفاصيل الملكية

source: Contract Terms
ar: شروط العقد

# read_terms
source: Please read the terms and conditions carefully before starting
ar: يرجى قراءة الشروط والأحكام بعناية قبل البدء

# terms_text
source: 1. The contractor must comply with all terms and conditions mentioned in this contract. 2. The project owner is obligated to pay the agreed-upon amount on the specified dates. 3. Both parties have the right to terminate the contract according to specified conditions in case of non-compliance. 4. The contractor is committed to providing all necessary materials to complete the project. 5. The contractor assumes full responsibility for any damages or losses resulting from negligence. 6. The contractor must submit regular progress reports. 7. Both parties agree to maintain confidentiality regarding contract-related information.
ar: 1. يجب على المقاول الالتزام بكافة الشروط والأحكام المذكورة في هذا العقد. 2. يلتزم صاحب المشروع بدفع القيمة المتفق عليها في المواعيد المحددة. 3. يحق للطرفين إنهاء العقد وفقًا للشروط المحددة في حالة عدم الالتزام. 4. يتعهد المقاول بتوفير جميع المواد اللازمة لإنجاز المشروع. 5. يتحمل المقاول المسؤولية الكاملة عن أي أضرار أو خسائر ناتجة عن الإهمال. 6. يجب على المقاول تقديم تقارير دورية عن تقدم العمل. 7. يلتزم الطرفان بالحفاظ على سرية المعلومات المتعلقة بالعقد.

# agree_text
source: I have read and agree to the above terms and conditions
ar: لقد قرأت وأوافق على الشروط والأحكام المذكورة أعلاه

# start_button
source: Start
ar: ابدأ

# terms_textdaily
source: Terms: 1. Full compliance with the contract provisions. 2. Payment of the agreed amount. 3. The right to terminate the contract under specified conditions.
ar: الشروط: 1. الالتزام الكامل بأحكام العقد. 2. دفع المبلغ المتفق عليه. 3. الحق في إنهاء العقد وفقًا للشروط المحددة.

# terms_and_conditions
source: By using this contract form, both parties agree to the following terms and conditions: 1. The First Party (Employer) and Second Party (Employee) agree to respect the contractual obligations established in this agreement. 2. Both parties shall provide accurate and complete information, including but not limited to identification, nationality, and address details. 3. The Employee agrees to fulfill the role described by the Job Title with the duties as assigned by the Employer. 4. The employment period shall extend for the Contract Duration as specified. Any changes to this duration require mutual agreement and formal documentation. 5. The Salary, as specified, shall be compensated according to the agreed-upon payment schedule. 6. Both parties shall adhere to the local labor laws and any other relevant regulations governing the employment relationship. 7. Any dispute arising from this agreement shall first be resolved through negotiation and mutual agreement. If a resolution is not reached, legal measures may be pursued as per applicable law. 8. This contract shall be terminated if either party violates any of the agreed terms, subject to the applicable labor laws. By signing this contract, both parties confirm that they have read, understood, and agreed to all terms and conditions listed above.
ar: باستخدام هذه النموذج التعاقدي، يوافق الطرفان على الشروط والأحكام التالية: 1. يوافق الطرف الأول (صاحب العمل) والطرف الثاني (الموظف) على احترام الالتزامات التعاقدية الموضوعة في هذا الاتفاق. 2. يجب على كلا الطرفين تقديم معلومات دقيقة وكاملة، بما في ذلك -وليس حصرًا- تفاصيل الهوية والجنسية والعنوان. 3. يلتزم الموظف بالقيام بالدور المحدد في مسمى الوظيفة والمهام الموكلة إليه من قبل صاحب العمل. 4. تمتد فترة العمل لمدة العقد كما هو محدد. أي تغييرات على هذه المدة تتطلب اتفاقًا متبادلًا وتوثيقًا رسميًا. 5. سيتم دفع الراتب، كما هو محدد، وفقًا لجدول الدفع المتفق عليه. 6. يجب على الطرفين الامتثال لقوانين العمل المحلية وأي لوائح أخرى ذات صلة تحكم العلاقة الوظيفية. 7. يتم حل أي نزاع ينشأ عن هذا الاتفاق أولاً من خلال التفاوض والتفاهم المتبادل. إذا لم يتم التوصل إلى حل، يمكن اتخاذ الإجراءات القانونية وفقًا للقانون الساري. 8. يتم إنهاء هذا العقد إذا انتهك أي من الطرفين أيًا من الشروط المتفق عليها، وذلك وفقًا لقوانين العمل السارية. بتوقيع هذا العقد، يؤكد الطرفان أنهما قرأوا وفهموا ووافقوا على جميع الشروط والأحكام المذكورة أعلاه.

# accept_terms
source: Accept Terms and Conditions
ar: قبول الشروط والأحكام

# terms_intro
source: Please read the terms and conditions below carefully before proceeding.
ar: يرجى قراءة الشروط والأحكام أدناه بعناية قبل المتابعة.

# terms_privacy
source: Your privacy and data are protected under our policy.
ar: سيتم حماية خصوصيتك وبياناتك بموجب سياستنا.

# terms_responsibility
source: Each party is responsible for fulfilling their obligations.
ar: كل طرف مسؤول عن الوفاء بالتزاماته.

# terms_payment
source: Payments must be completed as per the contract terms.
ar: يجب إتمام الدفعات حسب شروط العقد.

# terms_cancellation
source: Cancellations must be notified 30 days in advance.
ar: يجب إشعار الإلغاء قبل 30 يومًا.

# terms_disputes
source: Any disputes arising during the contract period...
ar: يتم حل أي نزاعات قد تنشأ خلال فترة العقد...

# terms_conclusion
source: By proceeding, you agree to the above terms.
ar: بالمتابعة، فإنك توافق على الشروط المذكورة أعلاه.

# loginPrivacyPolicy
source: Privacy Policy
ar: سياسة الخصوصية

# terms_work_information
source: The first party is obligated to provide...
ar: يلتزم الطرف الأول بتقديم جميع المعلومات اللازمة...

# terms_passport
source: The second party must provide a valid passport...
ar: يجب على الطرف الثاني تقديم جواز سفر ساري...

# terms_start_date
source: Both parties agree to adhere to the contract...
ar: يتفق الطرفان على الالتزام بتاريخ بدء العقد...

# terms_labor_law
source: The first party commits to applying local labor laws...
ar: يلتزم الطرف الأول بتطبيق قوانين العمل المحلية...

# terms_contract_termination
source: In case of contract termination, either party...
ar: في حالة إنهاء العقد، يتعين على أي من الطرفين...

# terms_performance
source: The second party is expected to perform tasks...
ar: يلتزم الطرف الثاني بأداء المهام المحددة...

# terms_agreement
source: By proceeding, I acknowledge that I have read...
ar: بالمتابعة، أقر أنني قد قرأت ووافقت على...

# terms_and_conditions1
source: [Terms and Conditions 1. The tenant must pay the rent on time. 2. The tenant is responsible for maintaining the used equipment. 3. The tenant may not use the equipment for unauthorized purposes. 4. The owner has the right to cancel the contract if the tenant does not comply with the terms. 5. The tenant must return the equipment in good condition after the contract ends. ]
ar: [الشروط 1. يجب على المستأجر أن يدفع القيمة الإيجارية في الوقت المحدد. 2. يتحمل المستأجر مسؤولية صيانة المعدات المستخدمة. 3. لا يجوز للمستأجر استخدام المعدات لأغراض غير مصرح بها. 4. يحق للمالك إلغاء العقد إذا لم يلتزم المستأجر بالشروط. 5. يجب على المستأجر إرجاع المعدات في حالة جيدة بعد انتهاء العقد. ]

# app_bar_title
source: Agree to Terms
ar: أوافق على الشروط

# acceptHouseTitle
source: Accept Rental Contract
ar: قبول عقد الإيجار

# houseRentContract
source: House Rental Contract Terms: 1. The tenant must pay the rent on time. 2. The landlord must provide the property in good condition. 3. No alterations to the property are allowed without the landlord's approval. 4. The landlord must be notified of any damages that occur to the property. 5. The tenant must comply with local laws.
ar: شروط عقد إيجار المنزل: 1. يجب على المستأجر دفع الإيجار في الوقت المحدد. 2. يجب على المؤجر تقديم العقار في حالة جيدة. 3. لا يُسمح بإجراء تغييرات على العقار دون موافقة المؤجر. 4. يجب إبلاغ المؤجر بأي أضرار تحدث في العقار. 5. يجب على المستأجر الالتزام بالقوانين المحلية.

# helloWorldDescription
source: The conventional newborn programmer greeting
ar: تحية المبرمج المبتدئ التقليدية

source: Social Media
ar: وسائل التواصل الاجتماعي

# socialMediaDescription
source: Online platforms and tools that enable people to create, share, and interact with content in virtual communities.
ar: المنصات والأدوات عبر الإنترنت التي تمكن الناس من إنشاء ومشاركة والتفاعل مع المحتوى في المجتمعات الافتراضية.

# loginScreen
source: Login
ar: تسجيل الدخول

# loginScreenDescription
source: Screen where users enter their credentials to access the app.
ar: الشاشة حيث يدخل المستخدمون بيانات اعتمادهم للوصول إلى التطبيق.

# signupScreen
source: Signup
ar: تسجيل

# signupScreenDescription
source: Screen where new users create an account to join the app.
ar: الشاشة حيث يقوم المستخدمون الجدد بإنشاء حساب للانضمام إلى التطبيق.

source: Reset Password
ar: إعادة تعيين كلمة المرور

# resetPasswordDescription
source: Option for users to reset their forgotten password.
ar: خيار للمستخدمين لإعادة تعيين كلمة المرور المنسية.

# homeScreen
source: Home
ar: الرئيسية

# homeScreenDescription
source: Main screen of the app where users land after logging in.
ar: الشاشة الرئيسية للتطبيق حيث يهبط المستخدمون بعد تسجيل الدخول.

# chatScreen
source: Chat
ar: الدردشة

# chatScreenDescription
source: Screen for real-time messaging between users.
ar: الشاشة للمراسلة الفورية بين المستخدمين.

# searchScreen
source: Search
ar: بحث

# searchScreenDescription
source: Screen for users to search for other users, posts, or content.
ar: الشاشة حيث يمكن للمستخدمين البحث عن مستخدمين آخرين أو منشورات أو محتوى.

# addScreen
source: Add
ar: إضافة

# addScreenDescription
source: Screen for adding new content or posts.
ar: الشاشة لإضافة محتوى أو منشورات جديدة.

# profileScreen
source: Profile
ar: الملف الشخصي

# chatbotTextFieldHintText
source: Type your message...
ar: اكتب رسالتك...

# profileScreenDescription
source: Screen displaying user's profile information and settings.
ar: الشاشة التي تعرض معلومات وإعدادات الملف الشخصي للمستخدم.

# editProfileScreen
source: Edit Profile
ar: تعديل الملف الشخصي

# editProfileScreenDescription
source: Screen where users can edit their profile information.
ar: الشاشة حيث يمكن للمستخدمين تعديل معلومات ملفهم الشخصي.

# notificationScreen
source: Notification
ar: الإشعارات

# notificationScreenDescription
source: Screen displaying notifications about user interactions.
ar: الشاشة التي تعرض إشعارات حول تفاعلات المستخدم.

source: ChatBot
ar: روبوت المحادثة

# chatBotDescription
source: Automated bot for assisting users in the chat.
ar: روبوت آلي لمساعدة المستخدمين في الدردشة.

source: Description
ar: الوصف

# condition_1
source: The renter must provide a valid ID before receiving the car.
ar: يجب على المستأجر تقديم هوية سارية المفعول قبل استلام السيارة.

# condition_2
source: The renter must pay the insurance amount before receiving the car.
ar: يجب على المستأجر دفع مبلغ التأمين قبل استلام السيارة.

# condition_3
source: The renter is responsible for any damage or loss that occurs to the car during the rental period.
ar: يتحمل المستأجر مسؤولية أي تلف أو ضرر يحدث للسيارة أثناء فترة الإيجار.

# condition_4
source: The renter must adhere to the agreed rental schedule.
ar: يجب على المستأجر الالتزام بجدول الإيجار المتفق عليه.

# condition_5
source: The car must not be used for any illegal activities.
ar: لا يجوز استخدام السيارة في أي أنشطة غير قانونية.

# condition_6
source: The car must be returned on time and in good condition.
ar: يجب إعادة السيارة في الوقت المحدد وبحالة جيدة.

# condition_7
source: In case of violating any of the mentioned terms, the owner has the right to cancel the contract.
ar: في حالة الإخلال بأي شرط من الشروط المذكورة، يحق للمالك إلغاء العقد.

# descriptionDescription
source: Text describing a user's profile or content.
ar: نص يصف ملف المستخدم أو المحتوى.

source: Post
ar: منشور

# postDescription
source: Content shared by users on the platform.
ar: المحتوى الذي يشاركه المستخدمون على المنصة.

source: Photos
ar: صور

# photosDescription
source: Images uploaded or shared by users.
ar: الصور التي تم تحميلها أو مشاركتها بواسطة المستخدمين.

source: Display name
ar: اسم العرض

# displayNameDescription
source: Name shown publicly on the app.
ar: الاسم الذي يظهر علنًا على التطبيق.

source: User name
ar: اسم المستخدم

# userNameDescription
source: Unique identifier chosen by the user for their account.
ar: معرف فريد يختاره المستخدم لحسابه.

source: Update
ar: تحديث

# updateDescription
source: Action to save changes or refresh information.
ar: إجراء لحفظ التغييرات أو تحديث المعلومات.

source: Type message...
ar: اكتب رسالة...

# typeMessageDescription
source: Field where users enter messages for chat or posts.
ar: الحقل الذي يدخل فيه المستخدمون الرسائل للدردشة أو المنشورات.

source: You
ar: أنت

# youDescription
source: Indicates the user themselves.
ar: تشير إلى المستخدم نفسه.

source: Email
ar: البريد الإلكتروني

# emailDescription
source: User's email address.
ar: عنوان البريد الإلكتروني للمستخدم.

source: Password
ar: كلمة المرور

# passwordDescription
source: Secret code used for user authentication.
ar: رمز سري يستخدم للمصادقة على المستخدم.

source: Login
ar: تسجيل الدخول

# loginDescription
source: Action to enter the app with credentials.
ar: الإجراء لدخول التطبيق باستخدام بيانات الاعتماد.

source: Signup
ar: تسجيل

# signupDescription
source: Action to create a new account.
ar: الإجراء لإنشاء حساب جديد.

source: Show
ar: إظهار

# showDescription
source: Action to reveal hidden content.
ar: إجراء لكشف المحتوى المخفي.

source: Hide
ar: إخفاء

# hideDescription
source: Action to conceal content.
ar: إجراء لإخفاء المحتوى.

source: Uppercase
ar: حروف كبيرة

# uppercaseDescription
source: Text or characters in capital letters.
ar: النص أو الحروف بحروف كبيرة.

source: Lowercase
ar: حروف صغيرة

# lowercaseDescription
source: Text or characters in small letters.
ar: النص أو الحروف بحروف صغيرة.

source: Number
ar: رقم

# numberDescription
source: Numeric value or digit.
ar: قيمة رقمية أو رقم.

source: Special Character
ar: رمز خاص

# specialCharacterDescription
source: Non-alphanumeric character like !, @, #, $, etc.
ar: رمز غير أبجدي مثل !، @، #، $، إلخ.

source: Minimum Character
ar: حد أدنى من الأحرف

# minimumCharacterDescription
source: Requirement specifying the smallest count of characters allowed.
ar: متطلبات تحدد الحد الأدنى من عدد الأحرف المسموح بها.

source: Already Have An Account?
ar: هل لديك حساب بالفعل؟

# alreadyHaveAnAccountDescription
source: Question indicating whether the user already has an existing account.
ar: سؤال يوضح ما إذا كان لدى المستخدم حساب موجود.

source: You Don't Have An Account?
ar: لا تملك حسابًا؟

# youDontHaveAnAccountDescription
source: Question indicating whether the user doesn't have an existing account.
ar: سؤال يوضح ما إذا كان لدى المستخدم حساب موجود أم لا.

source: Create Account
ar: إنشاء حساب

source: Phone
ar: الهاتف

# signupTextQuestion
source: Already have an account?
ar: هل لديك حساب بالفعل؟

# signupConditionText
source: By logging in, you agree to our
ar: عند تسجيل الدخول، فإنك توافق على

# signupAboutApp
source: Sign up now and start exploring all that our app has to offer. We're excited to welcome you to our community!
ar: سجل الآن وابدأ استكشاف كل ما يقدمه تطبيقنا. نحن متحمسون للترحيب بك في مجتمعنا!

# signupPasswordValidationAtLeastOneLowerCaseLetter
source: At least 1 lowercase letter
ar: على الأقل 1 حرف صغير

# signupPasswordValidationAtLeastOneUpperCaseLetter
source: At least 1 uppercase letter
ar: على الأقل 1 حرف كبير

# signupPasswordValidationAtLeastOneSpecialCharacter
source: At least 1 special character
ar: على الأقل 1 رمز خاص

# signupPasswordValidationAtLeastOneNumber
source: At least 1 number
ar: على الأقل 1 رقم

# signupPasswordValidationAtLeastEightCharactersLong
source: At least 8 characters long
ar: يجب أن يتكون من 8 أحرف على الأقل

# createAccountDescription
source: Action to start the process of creating a new account.
ar: إجراء لبدء عملية إنشاء حساب جديد.

source: Delete Post
ar: حذف المنشور

source: Choose Your Contract
ar: اختر عقدك

source: Lease Contracts
ar: عقود الإيجار

# waiverContractsTitle
source: Waiver Contracts
ar: عقود التنازل

# notificatiomDescreption
source: Notification Description
ar: وصف الإشعار

# userNameNotification
source: @username
ar: @اسم المستخدم

# sellCardAppBar
source: Sales Contracts
ar: عقود البيع

source: Employment Contract
ar: عقد العمل

# acceptTermsTitle
source: Acceptance of Terms
ar: قبول الشروط

# cancellationTerms
source: By proceeding with the contract cancellation, you agree to the following terms: 1. The landlord and tenant must both consent to the cancellation. 2. Any outstanding payments must be settled before cancellation is finalized. 3. The property must be returned in its original condition, as per the contract. 4. Both parties will waive any future claims related to the contract after cancellation. 5. A formal notice period of 30 days is required before the contract can be considered void. Please review these terms carefully before proceeding.
ar: بالموافقة على إلغاء العقد، فإنك توافق على الشروط التالية: 1. يجب موافقة كل من المؤجر والمستأجر على الإلغاء. 2. يجب تسوية أي مدفوعات مستحقة قبل إتمام الإلغاء. 3. يجب إعادة العقار إلى حالته الأصلية كما هو مذكور في العقد. 4. يتنازل كلا الطرفين عن أي مطالبات مستقبلية تتعلق بالعقد بعد الإلغاء. 5. يجب تقديم إشعار رسمي لمدة 30 يومًا قبل أن يعتبر العقد ملغى. يرجى مراجعة هذه الشروط بعناية قبل المتابعة.

# property_condition_1
source: The property must be in good condition.
ar: يجب أن تكون الملكية في حالة جيدة.

# property_condition_2
source: The buyer must be financially qualified.
ar: يجب أن يكون المشتري مؤهلاً مالياً.

# property_condition_3
source: The property transfer must comply with local laws.
ar: يجب أن يتوافق نقل الملكية مع القوانين المحلية.

# property_condition_4
source: All documents must be verified before signing.
ar: يجب التحقق من جميع الوثائق قبل التوقيع.

# property_condition_5
source: Any liens or debts must be cleared before transfer.
ar: يجب أن يتم تسوية أي رهون أو ديون قبل النقل.

# property_condition_6
source: The buyer has the right to inspect the property.
ar: للمشتري الحق في فحص الملكية.

# property_condition_7
source: The seller guarantees clear title to the property.
ar: يضمن البائع حقوق ملكية واضحة للملكية.

# chatbotAppbarTitle
source: Ask lawyer
ar: اسال محامي

# deletePostDescription
source: Action to remove a post or content.
ar: إجراء لإزالة منشور أو محتوى.

# terms_header
source: Terms and Conditions
ar: الشروط والأحكام
